# CannotProcessInStairsSketchEditMode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotProcessInStairsSketchEditMode Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot process when stair(s) in sketch edit mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotProcessInStairsSketchEditMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotProcessInStairsSketchEditMode As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotProcessInStairsSketchEditMode {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace